IDEA Open Model
RigidLink.SlaveNodes Property
 Dependent nodes
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.0.1.1 (10.0.1.1)
Syntax
public List<ReferenceElement> SlaveNodes { get; set; }
Public Property SlaveNodes As List(Of ReferenceElement)
	Get
	Set
public:
property List<ReferenceElement^>^ SlaveNodes {
	List<ReferenceElement^>^ get ();
	void set (List<ReferenceElement^>^ value);
}
Property Value
Type: List<ReferenceElement>
See Also
Reference
RigidLink Class
IdeaRS.OpenModel.Model Namespace